Son comandos pendejos para ejecutar comandos desde un dispositivo sobre otro.
# SSH en Cisco y Redes

## Â QuÃ© es
- **SSH** (Secure Shell) es un protocolo de la **capa de aplicaciÃ³n (OSI)**. Â 
- Permite administraciÃ³n remota de dispositivos de red como Telnet, pero con **cifrado**. Â 
- Usa **TCP (capa de transporte)**, **puerto 22** por defecto. Â 
-  Tiras comandos en una maquina y se ejecutan en otra
## Â Protocolos de capas inferiores
- **Transporte**: TCP. Â 
- **Red**: IP. Â 
- **Enlace**: Ethernet (u otro segÃºn el medio). Â 
## âš™ï¸ Comandos bÃ¡sicos en Cisco IOS

Configurar el router/switch como **servidor SSH**:

```bash

Router(config)# hostname R1

Router(config)# ip domain-name midominio.com

Router(config)# crypto key generate rsa Â  # genera claves RSA

Router(config)# username admin secret cisco123

Router(config)# line vty 0 4

Router(config-line)# login local

Router(config-line)# transport input ssh

```

Conectarse como **cliente SSH**:

```bash

Router> ssh -l admin 192.168.1.1

```
## Â AutenticaciÃ³n y seguridad
- Cifrado con RSA (u otros algoritmos). Â 
- Usuario y contraseÃ±a van cifrados â†’ comunicaciÃ³n segura. Â 
## Â Uso tÃ­pico
1. AdministraciÃ³n remota segura de routers, switches y servidores. Â 
2. Transferencia segura de archivos (SCP/SFTP). Â 
## Â Ventajas sobre Telnet
- **Cifrado completo** de datos. Â 
- **AutenticaciÃ³n fuerte** con usuarios locales o externos. Â 
- EstÃ¡ndar actual en redes empresariales y en Internet.
# Telnet en Cisco y Redes

  

## Â QuÃ© es

- **Telnet** (Telecommunication Network) es un protocolo de la **capa de aplicaciÃ³n (OSI)**. Â 

- Permite la **administraciÃ³n remota de dispositivos de red** (routers, switches, servidores). Â 

- Usa **TCP (capa de transporte)**, **puerto 23** por defecto. Â 

## ğŸ“Š Protocolos de capas inferiores

- **Transporte**: TCP (confiable, orientado a conexiÃ³n). Â 

- **Red**: IP. Â 

- **Enlace**: Ethernet (u otro protocolo segÃºn el medio). Â 

## âš™ï¸ Comandos bÃ¡sicos en Cisco IOS

En el **cliente** (desde otro router, switch o PC):

```bash

Router> telnet 192.168.1.1

```

En el **servidor Telnet** (el dispositivo que va a aceptar conexiones):

```bash
#// esto es accediendo a la configuracion de lineas virtual teletype para acceder al servidor. Cada linea es una posible conexion. Entonces puede haber un maximo de 5 conexiones en simultaneo.
Router(config)# line vty 0 4
#// aca pongo contrasena
Router(config-line)# password cisco
#// aca exijo que se logueen antes de entrar
Router(config-line)# login
#// aca digo que esas lineas se manejen con telnet especificamente
Router(config-line)# transport input telnet

```

## ğŸ”‘ AutenticaciÃ³n

- Usuario/contraseÃ±a enviados en **texto plano**. Â 

- No hay cifrado de datos â†’ inseguro en redes reales. Â 

## ğŸ› ï¸ Uso tÃ­pico

1. Conectar a un router/switch en la misma red o a travÃ©s de Internet. Â 

2. Administrar remotamente el dispositivo como si estuvieras en la consola. Â 

## âš ï¸ Limitaciones

- **Sin cifrado**: credenciales y datos pueden ser interceptados. Â 

- Obsoleto en redes modernas, reemplazado por SSH.